%初始化种群大小
%输入变量：
%popsize：种群大小
%chromlength：染色体长度-->>转化的二进制长度
%输出变量：
%pop：种群
function pop=initpop(popsize,chromlength)
pop = round(rand(popsize,chromlength));
%rand(5,5)生成5行5列的0-1之间的随机数
% rand(5,5)
% 
%ans =
%
%   0.8147    0.0975    0.1576    0.1419    0.6557
%    0.9058    0.2785    0.9706    0.4218    0.0357
%    0.1270    0.5469    0.9572    0.9157    0.8491
%    0.9134    0.9575    0.4854    0.7922    0.9340
%    0.6324    0.9649    0.8003    0.9595    0.6787
%round就是四舍五入
% round(ans)=
%ans =
%     1     0     0     0     1
%     1     0     1     0     0
%     0     1     1     1     1
%     1     1     0     1     1
%     1     1     1     1     1
%所以返回的种群就是每行是一个个体，列数是染色体长度
